IdeaRS.OpenModel.Loading.LoadCaseSubType
Load case sub type

IdeaRS.OpenModel.Loading.LoadCaseSubType.PermanentSelfweight
Permanent - self weight

IdeaRS.OpenModel.Loading.LoadCaseSubType.PermanentStandard
Permanent - standard

IdeaRS.OpenModel.Loading.LoadCaseSubType.PermanentPrestress
Permanent - prestress (posttensioned)

IdeaRS.OpenModel.Loading.LoadCaseSubType.PermanentRheologic
Permanent - Rheologic

IdeaRS.OpenModel.Loading.LoadCaseSubType.PermanentPrimaryEffect
Permanent - primary effect

IdeaRS.OpenModel.Loading.LoadCaseSubType.VariableStatic
Variable - static

IdeaRS.OpenModel.Loading.LoadCaseSubType.VariableDynamic
Variable - dynamic

IdeaRS.OpenModel.Loading.LoadCaseSubType.VariablePrimaryEffect
Variable - primary effect

IdeaRS.OpenModel.Loading.LoadCaseSubType.PermanentPrestressPretensioned
Permanent - prestress (posttensioned)

IdeaRS.OpenModel.Loading.LoadCaseSubType.PermanentPrestressPrimary
Permanent - prestress primary effect

IdeaRS.OpenModel.Loading.LoadCaseSubType.PermanentSelfweightLocal
Permanent - self weight - local